s='helloworld'
print('{0:*<20}'.format(s)) # 左对齐，总宽度20，空白用*填充
print('{0:*>20}'.format(s)) # 右对齐，总宽度20，空白用*填充
print('{0:*^20}'.format(s)) # 居中对齐，总宽度20，空白用*填充
print('{0:*^20.5}'.format(s)) # 居中对齐，总宽度20，空白用*填充，取5个字符

# 居中对齐
print(s.center(20,'*'))
# 左对齐
print(s.ljust(20,'*'))
# 右对齐
print(s.rjust(20,'*'))

# 千位分隔符（只适用于整数和浮点数）
print('{0:,}'.format(123456789)) # 123,456,789
print('{0:,}'.format(123456789.1234)) # 123,456,789.1234

# 浮点数精度控制
print('{0:.2f}'.format(3.1415926))
# 字符串类型，表示最大的显示长度
print('{0:.5}'.format('helloworld')) # hello

# 整数类型
a=425
print('二进制:{0:b}, 八进制:{0:o}, 十进制:{0:d}, 十六进制:{0:x},十六进制：{0:X}'.format(a)) # 二进制:110101001, 八进制:651, 十进制:425, 十六进制:1a9

# 浮点数类型
b=3.1415926
print('{0:.2f},{0:.2E},{0:.2e},{0:.2%}'.format(b))