'''
转义字符
\n 换行
\t 制表符
\\ 反斜杠   
\' 单引号
\" 双引号
\r 回车
\b 退格
\f 换页
'''

print('北京')
print('欢迎你')
print('------------------')
print('北京\n欢迎你') #换行
print('北\n京\n欢\n迎\n你')
print('------------------')
print('北京\t欢迎你') #制表符
print('北\t京\t欢\t迎\t你')
print('北京北京\t欢迎你')
print('------------------')
print('hello\toooo')#一个制表符占8个字符
print('helloooo\to')
print('------------------')
print('北京\\欢迎你') #反斜杠
print('北京\'欢迎你') #单引号
print('北京\"欢迎你') #双引号
print('------------------') 

#原字符，使转义字符失效
print(r'北京\n欢迎你') #原字符
print(r'北京\t欢迎你') #原字符
print(R'北京\\欢迎你') #原字符

