dict={'G1569':['北京南-天津南','18:06','18:39','00:33']
,'G1567':['北京南-天津南','18:15','18:49','00:34']
,'G8917':['北京南-天津西','18:20','19:19','00:59']
,'G203':['北京南-天津南','18:35','19:09','00:34']}
print('车次   出发站-到达站  出发时间  到达时间  历时时长')
for key in dict:
    print(key,'\t',dict[key][0],'\t',dict[key][1],'\t',dict[key][2],'\t',dict[key][3])
number=input('请输入要购买的车次：')
name=input('请输入乘车人，如果是多位乘车人，使用逗号分隔：')
for key in dict:
    if key==number:
        print('您已购买了：'+key+' '+dict[key][0]+' '+dict[key][1]+'开，请'+name+'尽快换取纸质车票。【铁路客服】')
        break
else:
    print('您输入的车次不存在，请重新输入！')